پنجره بازکن با ۸۰۰ و ۶۰۰
ضخامت قلم برابر ۳
تابع پرش با زاویه و مسافت
    قلم بالا
    به_سمت با زاویه
    حرکت با مسافت
    قلم پایین
    به_سمت با ۰
تابع خط با زاویه و مسافت
    به_سمت با زاویه
    حرکت با مسافت
    به_سمت با ۰
رنگ قلم برابر -سیاه-
دایره با ۴۰
پرش با ۰ و ۱۲۰
دایره با ۴۰
پرش با ۱۸۰ و ۱۲۰
پرش با ۹۰ و ۴۰
رنگ قلم برابر -قرمز-
خط با ۶۰ و ۵۰
خط با ۹۰ و ۸
خط با ۱۸۰ و ۱۰
خط با ۰ و ۲۵
پرش با ۱۸۰ و ۱۵
پرش با ۲۷۰ و ۸
خط با ۰ و ۷۰
خط با ۹۰ و ۱۸
خط با ۰ و ۱۵
پرش با ۱۸۰ و ۱۵
پرش با ۲۷۰ و ۱۸
خط با ۳۰۰ و ۵۰
پرش با ۱۸۰ و ۷۰
خط با ۱۲۰ و ۵۰
پرش با ۳۰۰ و ۵۰
خط با ۴۴ و ۶۲٫۴
پرش با ۲۲۴ و ۶۲٫۴
خط با ۱۸۰ و ۵۰
