پنجره بازکن با ۸۰۰ و ۶۰۰
ضخامت قلم برابر ۳
تابع پرش با زاویه و مسافت
    قلم بالا
    به_سمت با زاویه
    حرکت با مسافت
    قلم پایین
    به_سمت با ۰
تابع خط با زاویه و مسافت
    به_سمت با زاویه
    حرکت با مسافت
    به_سمت با ۰
رنگ قلم برابر -سیاه-
خط با ۹۰ و ۱۰۰
خط با ۶۰ و ۳۰
پرش با ۲۴۰ و ۳۰
خط با ۱۲۰ و ۳۰
پرش با ۳۰۰ و ۳۰
پرش با ۲۷۰ و ۶۵
رنگ قلم برابر -نارنجی-
پرش با ۰ و ۴۵
دایره با ۴۰
پرش با ۱۸۰ و ۹۰
دایره با ۴۰
رنگ قلم برابر -بنفش-
پرش با ۲۷۰ و ۴۳
پرش با ۰ و ۱۰
دایره با ۲۸
پرش با ۰ و ۷۰
دایره با ۲۸
