پنجره بازکن با ۸۰۰ و ۶۰۰
ضخامت قلم برابر ۳
تابع پرش با زاویه و مسافت
    قلم بالا
    به_سمت با زاویه
    حرکت با مسافت
    قلم پایین
    به_سمت با ۰
تابع خط با زاویه و مسافت
    به_سمت با زاویه
    حرکت با مسافت
    به_سمت با ۰
تابع کمان با شعاع
    چرخش با ۳۵۷٫۵
    تکرار ۱۸
        حرکت با ۲ * ۳٫۱۴۱۶ * شعاع / ۷۲
        چرخش با ۳۵۵
    چرخش با ۲٫۵
رنگ قلم برابر -آبی-
به_سمت با ۴۵
کمان با ۷۰
چرخش با ۲۷۰
کمان با ۷۰
پرش با ۰ و ۹۹
رنگ قلم برابر -نارنجی-
خط با ۳۰ و ۴۵
خط با ۲۷۰ و ۴۵
خط با ۱۵۰ و ۴۵
رنگ قلم برابر -سیاه-
پرش با ۱۸۰ و ۷۱
پرش با ۹۰ و ۵
دایره با ۵
