پنجره بازکن با ۸۰۰ و ۶۰۰
ضخامت قلم برابر ۳
تابع پرش با زاویه و مسافت
    قلم بالا
    به_سمت با زاویه
    حرکت با مسافت
    قلم پایین
    به_سمت با ۰
تابع خط با زاویه و مسافت
    به_سمت با زاویه
    حرکت با مسافت
    به_سمت با ۰
تابع گلبرگ با زاویه
    پرش با زاویه و ۳۸
    پرش با ۲۷۰ و ۱۸
    دایره با ۱۸
    پرش با ۹۰ و ۱۸
    پرش با زاویه + ۱۸۰ و ۳۸
رنگ قلم برابر -قرمز-
بگذار زاویه_گلبرگ برابر ۰
تکرار ۸
    گلبرگ با زاویه_گلبرگ
    بگذار زاویه_گلبرگ برابر زاویه_گلبرگ + ۴۵
رنگ قلم برابر -زرد-
پرش با ۲۷۰ و ۱۲
دایره با ۱۲
پرش با ۹۰ و ۱۲
رنگ قلم برابر -سبز-
پرش با ۲۷۰ و ۵۶
خط با ۲۷۰ و ۱۰۰
پرش با ۹۰ و ۶۰
مثلث با ۳۵
