پنجره بازکن با ۸۰۰ و ۶۰۰
ضخامت قلم برابر ۳
تابع پرش با زاویه و مسافت
    قلم بالا
    به_سمت با زاویه
    حرکت با مسافت
    قلم پایین
    به_سمت با ۰
تابع خانه با اندازه
    رنگ قلم برابر -قرمز-
    مربع با اندازه
    رنگ قلم برابر -نارنجی-
    پرش با ۹۰ و اندازه
    مثلث با اندازه
    رنگ قلم برابر -آبی-
    پرش با ۲۷۰ و اندازه
    پرش با ۰ و اندازه * ۰٫۴
    مستطیل با اندازه * ۰٫۲ و اندازه * ۰٫۴۵
    پرش با ۱۸۰ و اندازه * ۰٫۳
    پرش با ۹۰ و اندازه * ۰٫۶
    مربع با اندازه * ۰٫۲
    پرش با ۰ و اندازه * ۰٫۶
    مربع با اندازه * ۰٫۲
    پرش با ۲۷۰ و اندازه * ۰٫۶
    پرش با ۱۸۰ و اندازه * ۰٫۷
تابع درخت با اندازه
    رنگ قلم برابر -#8B4513-
    پرش با ۱۸۰ و اندازه / ۸
    مستطیل با اندازه / ۴ و اندازه * ۰٫۸
    پرش با ۰ و اندازه / ۸
    رنگ قلم برابر -سبز-
    پرش با ۹۰ و اندازه * ۰٫۸
    دایره با اندازه * ۰٫۴۵
    پرش با ۲۷۰ و اندازه * ۰٫۸
رنگ قلم برابر -سبز-
پرش با ۱۸۰ و ۴۰
حرکت با ۳۵۰
پرش با ۱۸۰ و ۳۱۰
خانه با ۱۲۰
پرش با ۰ و ۱۹۰
درخت با ۱۰۰
پرش با ۰ و ۸۰
درخت با ۶۰
رنگ قلم برابر -#8B4513-
پرش با ۱۸۰ و ۲۹۰
پرش با ۲۷۰ و ۴۵
تکرار ۱۶
    مستطیل با ۱۲ و ۳۵
    پرش با ۰ و ۱۹
