پنجره بازکن با ۸۰۰ و ۶۰۰
ضخامت قلم برابر ۳
تابع پرش با زاویه و مسافت
    قلم بالا
    به_سمت با زاویه
    حرکت با مسافت
    قلم پایین
    به_سمت با ۰
تابع خانه با اندازه
    رنگ قلم برابر -قرمز-
    مربع با اندازه
    رنگ قلم برابر -نارنجی-
    پرش با ۹۰ و اندازه
    مثلث با اندازه
    رنگ قلم برابر -آبی-
    پرش با ۲۷۰ و اندازه
    پرش با ۰ و اندازه * ۰٫۴
    مستطیل با اندازه * ۰٫۲ و اندازه * ۰٫۴۵
    پرش با ۱۸۰ و اندازه * ۰٫۳
    پرش با ۹۰ و اندازه * ۰٫۶
    مربع با اندازه * ۰٫۲
    پرش با ۰ و اندازه * ۰٫۶
    مربع با اندازه * ۰٫۲
    پرش با ۲۷۰ و اندازه * ۰٫۶
    پرش با ۱۸۰ و اندازه * ۰٫۷
خانه با ۱۵۰
