پنجره بازکن با ۸۰۰ و ۶۰۰
ضخامت قلم برابر ۳
تابع پرش با زاویه و مسافت
    قلم بالا
    به_سمت با زاویه
    حرکت با مسافت
    قلم پایین
    به_سمت با ۰
تابع خانه با اندازه
    رنگ قلم برابر -قرمز-
    مربع با اندازه
    رنگ قلم برابر -نارنجی-
    پرش با ۹۰ و اندازه
    مثلث با اندازه
    رنگ قلم برابر -آبی-
    پرش با ۲۷۰ و اندازه
    پرش با ۰ و اندازه * ۰٫۴
    مستطیل با اندازه * ۰٫۲ و اندازه * ۰٫۴۵
    پرش با ۱۸۰ و اندازه * ۰٫۳
    پرش با ۹۰ و اندازه * ۰٫۶
    مربع با اندازه * ۰٫۲
    پرش با ۰ و اندازه * ۰٫۶
    مربع با اندازه * ۰٫۲
    پرش با ۲۷۰ و اندازه * ۰٫۶
    پرش با ۱۸۰ و اندازه * ۰٫۷
تابع درخت با اندازه
    رنگ قلم برابر -#8B4513-
    پرش با ۱۸۰ و اندازه / ۸
    مستطیل با اندازه / ۴ و اندازه * ۰٫۸
    پرش با ۰ و اندازه / ۸
    رنگ قلم برابر -سبز-
    پرش با ۹۰ و اندازه * ۰٫۸
    دایره با اندازه * ۰٫۴۵
    پرش با ۲۷۰ و اندازه * ۰٫۸
تابع کوه با اندازه
    رنگ قلم برابر -#78716c-
    مثلث با اندازه
    پرش با ۰ و اندازه * ۰٫۷
    مثلث با اندازه * ۰٫۶۵
    پرش با ۱۸۰ و اندازه * ۰٫۷
    رنگ قلم برابر -آبی-
    پرش با ۶۰ و اندازه * ۰٫۷۵
    مثلث با اندازه * ۰٫۲۵
    پرش با ۲۴۰ و اندازه * ۰٫۷۵
تابع پرتو با زاویه و اندازه
    پرش با زاویه و اندازه * ۱٫۲
    به_سمت با زاویه
    حرکت با اندازه * ۰٫۵
    پرش با زاویه + ۱۸۰ و اندازه * ۱٫۷
تابع خورشید با اندازه
    رنگ قلم برابر -نارنجی-
    پرش با ۹۰ و اندازه
    بگذار زاویه_پرتو برابر ۰
    تکرار ۱۲
        پرتو با زاویه_پرتو و اندازه
        بگذار زاویه_پرتو برابر زاویه_پرتو + ۳۰
    پرش با ۲۷۰ و اندازه
    رنگ قلم برابر -زرد-
    دایره با اندازه
تابع ابر با اندازه
    رنگ قلم برابر -آبی-
    حرکت با اندازه * ۱٫۴
    پرش با ۱۸۰ و اندازه * ۱٫۴
    دایره با اندازه * ۰٫۳
    پرش با ۰ و اندازه * ۰٫۴۵
    دایره با اندازه * ۰٫۴
    پرش با ۰ و اندازه * ۰٫۵
    دایره با اندازه * ۰٫۳۵
    پرش با ۰ و اندازه * ۰٫۴۵
    دایره با اندازه * ۰٫۲۸
    پرش با ۱۸۰ و اندازه * ۱٫۴
رنگ قلم برابر -سبز-
پرش با ۱۸۰ و ۱۵۰
حرکت با ۶۰۰
پرش با ۱۸۰ و ۵۵۰
خانه با ۱۰۰
پرش با ۰ و ۱۳۰
درخت با ۹۰
پرش با ۰ و ۷۰
کوه با ۲۶۰
پرش با ۹۰ و ۳۰۰
پرش با ۱۸۰ و ۱۹۰
خورشید با ۳۰
پرش با ۰ و ۲۹۰
ابر با ۶۰
