پنجره بازکن با ۸۰۰ و ۶۰۰
ضخامت قلم برابر ۳
تابع پرش با زاویه و مسافت
    قلم بالا
    به_سمت با زاویه
    حرکت با مسافت
    قلم پایین
    به_سمت با ۰
رنگ قلم برابر -#78716c-
دایره با ۵۰
پرش با ۹۰ و ۸۵
پرش با ۰ و ۵۵
دایره با ۳۰
رنگ قلم برابر -#f472b6-
پرش با ۹۰ و ۵۸
پرش با ۱۸۰ و ۳
به_سمت با ۹۵
مستطیل با ۶۰ و ۱۴
پرش با ۰ و ۲۰
به_سمت با ۷۰
مستطیل با ۶۰ و ۱۴
رنگ قلم برابر -سیاه-
پرش با ۲۷۰ و ۲۳
پرش با ۱۸۰ و ۷
دایره با ۳
پرش با ۰ و ۱۹
پرش با ۲۷۰ و ۷
رنگ قلم برابر -قرمز-
دایره با ۳
رنگ قلم برابر -#78716c-
پرش با ۱۸۰ و ۱۴۶
پرش با ۲۷۰ و ۶۷
دایره با ۱۲
پرش با ۲۷۰ و ۵۳
پرش با ۰ و ۷۲
مستطیل با ۳۰ و ۱۲
