پنجره بازکن با ۸۰۰ و ۶۰۰
ضخامت قلم برابر ۳
تابع پرش با زاویه و مسافت
    قلم بالا
    به_سمت با زاویه
    حرکت با مسافت
    قلم پایین
    به_سمت با ۰
تابع خط با زاویه و مسافت
    به_سمت با زاویه
    حرکت با مسافت
    به_سمت با ۰
رنگ قلم برابر -آبی-
پرش با ۰ و ۱۵
مستطیل با ۲۵ و ۵۰
پرش با ۰ و ۴۵
مستطیل با ۲۵ و ۵۰
پرش با ۱۸۰ و ۶۰
پرش با ۹۰ و ۵۰
مستطیل با ۱۰۰ و ۹۰
پرش با ۱۸۰ و ۳۰
پرش با ۹۰ و ۱۰
مستطیل با ۲۰ و ۶۰
پرش با ۰ و ۱۴۰
مستطیل با ۲۰ و ۶۰
رنگ قلم برابر -نارنجی-
پرش با ۱۸۰ و ۱۰۰
پرش با ۹۰ و ۸۰
مستطیل با ۸۰ و ۵۵
رنگ قلم برابر -قرمز-
پرش با ۰ و ۱۵
پرش با ۹۰ و ۲۰
مربع با ۱۵
پرش با ۰ و ۳۰
مربع با ۱۵
رنگ قلم برابر -سیاه-
پرش با ۱۸۰ و ۵
پرش با ۹۰ و ۳۵
خط با ۹۰ و ۲۵
دایره با ۷
