پنجره بازکن با ۸۰۰ و ۶۰۰
ضخامت قلم برابر ۳
تابع پرش با زاویه و مسافت
    قلم بالا
    به_سمت با زاویه
    حرکت با مسافت
    قلم پایین
    به_سمت با ۰
تابع پرتو با زاویه و اندازه
    پرش با زاویه و اندازه * ۱٫۲
    به_سمت با زاویه
    حرکت با اندازه * ۰٫۵
    پرش با زاویه + ۱۸۰ و اندازه * ۱٫۷
تابع خورشید با اندازه
    رنگ قلم برابر -نارنجی-
    پرش با ۹۰ و اندازه
    بگذار زاویه_پرتو برابر ۰
    تکرار ۱۲
        پرتو با زاویه_پرتو و اندازه
        بگذار زاویه_پرتو برابر زاویه_پرتو + ۳۰
    پرش با ۲۷۰ و اندازه
    رنگ قلم برابر -زرد-
    دایره با اندازه
خورشید با ۶۰
