# ---- توابع کمکی ----
# «صحیح»: عدد اعشاری (مثل ۳٫۰) را به عدد صحیح تبدیل می‌کند (برای اندیس فهرست)
تابع صحیح با x
    بگذار i برابر ۰
    تاوقتی i + ۱ <= x
        بگذار i برابر i + ۱
    بازگردان i
# «خوب»: گرد کردن تا ۶ رقم اعشار و حذف «.0» اضافی از انتهای عدد
تابع خوب با عدد
    بگذار ص برابر عدد * ۱۰۰۰۰۰۰ + ۰٫۵
    بگذار ص برابر (ص - ص % ۱) / ۱۰۰۰۰۰۰
    بگذار م برابر به_متن با ص
    بگذار ن برابر طول با م
    اگر ن > ۲
        اگر م[ن - ۲] == -.- و م[ن - ۱] == -0-
            بگذار خ برابر م[۰]
            بگذار ک برابر ۱
            تاوقتی ک < ن - ۲
                بگذار خ برابر خ + م[ک]
                بگذار ک برابر ک + ۱
            بازگردان خ
    بازگردان م
# ---- برنامه ----
تابع خارج با الف و ب
    بازگردان (الف - الف % ب) / ب
بگذار روزهای_ماه_میلادی برابر [۰، ۳۱، ۲۸، ۳۱، ۳۰، ۳۱، ۳۰، ۳۱، ۳۱، ۳۰، ۳۱، ۳۰، ۳۱]
چاپ -=== شمسی به میلادی ===-
چاپ -سال شمسی:-
بگذار س برابر بخوان
بگذار جس برابر به_عدد با س
چاپ -ماه (۱ تا ۱۲):-
بگذار س برابر بخوان
بگذار ع برابر به_عدد با س
بگذار جم برابر ع
چاپ -روز:-
بگذار س برابر بخوان
بگذار جر برابر به_عدد با س
بگذار جس برابر جس + ۱۵۹۵
بگذار ا برابر خارج با جس و ۳۳
بگذار ب برابر خارج با (جس % ۳۳ + ۳) و ۴
بگذار روزها برابر ۳۶۵ * جس + ۸ * ا + ب + جر - ۳۵۵۶۶۸
اگر جم < ۷
    بگذار روزها برابر روزها + (جم - ۱) * ۳۱
وگرنه
    بگذار روزها برابر روزها + (جم - ۷) * ۳۰ + ۱۸۶
بگذار گس برابر ۴۰۰ * خارج با روزها و ۱۴۶۰۹۷
بگذار روزها برابر روزها % ۱۴۶۰۹۷
اگر روزها > ۳۶۵۲۴
    بگذار روزها برابر روزها - ۱
    بگذار گس برابر گس + ۱۰۰ * خارج با روزها و ۳۶۵۲۴
    بگذار روزها برابر روزها % ۳۶۵۲۴
    اگر روزها >= ۳۶۵
        بگذار روزها برابر روزها + ۱
بگذار گس برابر گس + ۴ * خارج با روزها و ۱۴۶۱
بگذار روزها برابر روزها % ۱۴۶۱
اگر روزها > ۳۶۵
    بگذار گس برابر گس + خارج با (روزها - ۱) و ۳۶۵
    بگذار روزها برابر (روزها - ۱) % ۳۶۵
بگذار گر برابر روزها + ۱
بگذار کبیسه برابر ۲۸
اگر گس % ۴ == ۰
    اگر گس % ۱۰۰ != ۰
        بگذار کبیسه برابر ۲۹
اگر گس % ۴۰۰ == ۰
    بگذار کبیسه برابر ۲۹
بگذار گم برابر ۱
بگذار پایان برابر ۰
تاوقتی پایان == ۰
    بگذار طول_ماه برابر روزهای_ماه_میلادی[گم]
    اگر گم == ۲
        بگذار طول_ماه برابر کبیسه
    اگر گر > طول_ماه
        بگذار گر برابر گر - طول_ماه
        بگذار گم برابر گم + ۱
    وگرنه
        بگذار پایان برابر ۱
بگذار الف برابر خوب با گس
بگذار ب برابر خوب با گم
بگذار ج برابر خوب با گر
چاپ -تاریخ میلادی: - + الف + -/- + ب + -/- + ج
