# ---- ابزار نوازندگی (این بخش را دست نزنید) ----
# «درجه» = فاصلهٔ نیم‌پرده‌ای از دوی پایین؛ دوی میانی = ۲۴
بگذار دو برابر ۲۴
بگذار ر برابر ۲۶
بگذار می برابر ۲۸
بگذار فا برابر ۲۹
بگذار سل برابر ۳۱
بگذار لا برابر ۳۳
بگذار سی برابر ۳۵
بگذار تمپو برابر ۱۰۵
بگذار ضرب_مدت برابر ۶۰ / تمپو
تابع بسامد با درجه
    بگذار ف برابر ۶۵٫۴۰۶۴
    تکرار درجه
        بگذار ف برابر ف * ۱٫۰۵۹۴۶۳
    بازگردان ف
تابع بزن با درجه و طول
    بگذار ب برابر بسامد با درجه
    نت بنواز با ب و طول * ضرب_مدت * ۰٫۹
    نت بنواز با ۰ و طول * ضرب_مدت * ۰٫۱
تابع سکوت با طول
    نت بنواز با ۰ و طول * ضرب_مدت
# ---- ملودی ----
بزن با لا و ۰٫۵

بزن با دو + ۱۲ و ۱
بزن با ر + ۱۲ و ۰٫۵
بزن با می + ۱۲ و ۰٫۷۵
بزن با فا + ۱۲ و ۰٫۲۵
بزن با می + ۱۲ و ۰٫۵

بزن با ر + ۱۲ و ۱
بزن با سی و ۰٫۵
بزن با سل و ۰٫۷۵
بزن با لا و ۰٫۲۵
بزن با سی و ۰٫۵

بزن با دو + ۱۲ و ۱
بزن با لا و ۰٫۵
بزن با لا و ۰٫۷۵
بزن با سل + ۱ و ۰٫۲۵
بزن با لا و ۰٫۵

بزن با سی و ۱
بزن با سل + ۱ و ۰٫۵
بزن با می و ۱٫۵

بزن با لا و ۰٫۵

بزن با دو + ۱۲ و ۱
بزن با ر + ۱۲ و ۰٫۵
بزن با می + ۱۲ و ۰٫۷۵
بزن با فا + ۱۲ و ۰٫۲۵
بزن با می + ۱۲ و ۰٫۵

بزن با ر + ۱۲ و ۱
بزن با سی و ۰٫۵
بزن با سل و ۰٫۷۵
بزن با لا و ۰٫۲۵
بزن با سی و ۰٫۵

بزن با دو + ۱۲ و ۰٫۷۵
بزن با سی و ۰٫۲۵
بزن با لا و ۰٫۵
بزن با سل + ۱ و ۰٫۷۵
بزن با فا + ۱ و ۰٫۲۵
بزن با سل + ۱ و ۰٫۵

بزن با لا و ۲
