# ---- ابزار نوازندگی (این بخش را دست نزنید) ----
# «درجه» = فاصلهٔ نیم‌پرده‌ای از دوی پایین؛ دوی میانی = ۲۴
بگذار دو برابر ۲۴
بگذار ر برابر ۲۶
بگذار می برابر ۲۸
بگذار فا برابر ۲۹
بگذار سل برابر ۳۱
بگذار لا برابر ۳۳
بگذار سی برابر ۳۵
بگذار تمپو برابر ۱۱۰
بگذار ضرب_مدت برابر ۶۰ / تمپو
تابع بسامد با درجه
    بگذار ف برابر ۶۵٫۴۰۶۴
    تکرار درجه
        بگذار ف برابر ف * ۱٫۰۵۹۴۶۳
    بازگردان ف
تابع بزن با درجه و طول
    بگذار ب برابر بسامد با درجه
    نت بنواز با ب و طول * ضرب_مدت * ۰٫۹
    نت بنواز با ۰ و طول * ضرب_مدت * ۰٫۱
تابع سکوت با طول
    نت بنواز با ۰ و طول * ضرب_مدت
# ---- ملودی ----
بزن با می و ۱
بزن با ر و ۱
بزن با دو و ۱
بزن با ر و ۱

بزن با می و ۱
بزن با می و ۱
بزن با می و ۲

بزن با ر و ۱
بزن با ر و ۱
بزن با ر و ۲

بزن با می و ۱
بزن با سل و ۱
بزن با سل و ۲

بزن با می و ۱
بزن با ر و ۱
بزن با دو و ۱
بزن با ر و ۱

بزن با می و ۱
بزن با می و ۱
بزن با می و ۱
بزن با می و ۱

بزن با ر و ۱
بزن با ر و ۱
بزن با می و ۱
بزن با ر و ۱

بزن با دو و ۴
